import streamlit as st

st.markdown("""
            -flask + streamlit + python 程式運作
            -這六合彩程式，python 程式運作邏輯，主要是以種子投注法為核心，配合紅藍綠三色取球法，套用六神歸位，
            產生種子發球組合。程式複雜但投注簡單，一注單式投注。
            

            -1，當程式初始的第一投注，已電腦隨機發球為標準。
            -2，當該期投注，核對開獎日，沒有中獎，就取回今期不中獎的號碼，當成下一期預測照投注，直到中獎為止，
                同一注中獎最少 1 球號為中獎，中了一球名為種子球號。

            -3， 如有中了最少的種子球1球，就套下期投注中的第一球，其餘球號由此seed_lotto_strategy.py 策略系統發球補足。
            -4， 同一注中球1，2，3正號， 最多為 3 球，種子配合系統配腳。
            -種子球號運用 ＝ 1 球種子分成 1 注。2 球種子分成 2 注。3 球種子分成 3 注。
            -A-中一球，1種子 + 5
            -B-中二球：2種子 + 4
            -C-中三球：3種子 + 3
            -D-中 3 球是正號，最低派彩 40 元, 進階 3球種子 化成 3 注單式。作下期投注。

            -5，當第 4 項 完成，3 球種子，3注完全不中，
            -A.， No = 全不中獎，就當沒有種子處理，系統發隨機投注，單式。
            -B.， Yes = 有中獎種子球號，多過 3 球，隨機取 3 球為種子，分成 3 注。以第 4 項處理。

            """, 
            unsafe_allow_html=True)